<?php

if (!function_exists('transliterate')) {
    function transliterate($string): string
    {
        $cyr = ['А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ъ','Ы','Ь','Э','Ю','Я',
            'а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я'];
        $lat = ['A','B','V','G','D','E','Yo','J','Z','I','Y','K','L','M','N','O','P','R','S','T','U','F','X','Ts','Ch','Sh','Shch','','I','','E','Yu','Ya',
            'a','b','v','g','d','e','yo','j','z','i','y','k','l','m','n','o','p','r','s','t','u','f','x','ts','ch','sh','shch','','i','','e','yu','ya'];

        $converted = str_replace($cyr, $lat, $string);
        return strtolower($converted);
    }
}
